9f0807d8c3096d85a1c0153ba2baa2ffc56afeitib042@@@<NewVersion>4.9.8.1</NewVersion><NewVersionLink>https://chaldaev.pro/soft/VkMultiSender/VKMS.rar</NewVersionLink><NewVersionLinkExe>https://chaldaev.pro/soft/VkMultiSender/VKMS.exe</NewVersionLinkExe><NewVersionInfo>4.9.8.1 [30.01.2024]:
1. Модуль «Предложить новость» теперь кроме публичных страниц, также поддерживает и группы. Ранее группы просто пропускались, так как функция предложения новостей была доступна только пабликам.
2. Исправлена проблема с работоспособностью прокси.

4.9.8 [20.01.2024]:
Добавлена возможность прикреплять к сообщениям видеозаписи, загружая их напрямую с ПК.


4.9.7 [17.01.2024]:
1. Исправлена ошибка, возникающая при авторизации некоторых аккаунтов с использованием резервного кода.
2. Программа перенесена на новую версию среды разработки. Проблем с кодировкой на новых версиях Windows и Windows Server больше не будет.


4.9.6.6 [09.12.2023]:
Исправлена проблема с прикреплением фотографий в формате https://vk.com/photo123123_321321


4.9.6.5 [01.12.2023]:
Добавлена возможность прикрепления фотографий по прямым ссылкам. Например, с фотохостингов.
Для этого в поле "Вложения" необходимо вставить прямую ссылку на фотографию.
Пример: https://site.ru/img.jpg


4.9.6.4 [26.10.2023]:
Исправлены ошибки авторизации.


4.9.6.3 [22.10.2023]:
Исправлены ошибки с авторизацией, допущенные в прошлой версии.


4.9.6.2 [21.07.2023]:	
Добавлена возможность авторизации аккаунтов с двухфакторной авторизацией через резервный код.
Такие аккаунты загружаются в программу в формате:
Логин:пароль:резервный код


4.9.6.1 [14.07.2023]:
В модуле "Комментарии в сообществах" исправлен алгоритм выбора количества постов для рассылки.


4.9.6 [28.06.2023]:
1. Исправлена проблема с решением кириллической каптчи.
2. Исправлен баг в модуле "Беседы": "Аккаунт достин лимита и отключен от работы" при максимальном количестве участников в чате.


4.9.5 [02.06.2023]:
Исправлена ошибка при авторизации "Не удалось получить access_token для аккаунта".


4.9.4 [25.03.2023]:
[Беседы] Добавлено корректное реагирование программы на лимит аккаунта по вступлениям в чаты.


4.9.3 [10.03.2023]:
Восстановлена работоспособность авторизации после обновлений ВК.


4.9.2 [28.02.2023]:
Добавлена функция самоудаления аккаунта при достижении лимита.
Настройки самоудаления:
1. По достижению лимита отправленных сообщений, указанного вами.
2. По достижению лимита ВК.
3. По достижению любого лимита.

Функция активируется в разделе Настройки -> Лимиты.

4.9.1 [13.02.2023]:
Исправлено зависание авторизации при встрече заблокированного аккаунта.


4.9 [10.02.2023]:
Восстановлена работоспособность модуля "Комментарии к видеозаписям".


4.8.9 [02.02.2023]:
Исправлена проблема с авторизацией некоторых аккаунтов.


4.8.8 [24.01.2023]:
Исправлены проблемы с отправкой сообщений.


4.8.7 [21.01.2023]:
В модулях "Сообщения групп", "ЛС по списку", "Беседы" исправлена ошибка с отправкой сообщений.


4.8.6 [21.12.2022]:
1. В модуле "Предложить новость" исправлена ошибка "У аккаунта нет доступа к паблику".
2. В модуле "Комментарии в сообществах" исправлена ошибка "Комментарии закрыты, пропускаем".


4.8.5 [16.12.2022]:
Исправлена проблема с неразворачиванием программы после её сворачивания.

4.8.4 [28.11.2022]:
В модуле "Комментарии в сообществах" восстановлена работоспособность функции отправки комментариев от имени группы.

4.8.3 [12.11.2022]:
В модуле "Сообщения в группах" исправлена работоспособность отправки сообщений на аккаунтах с новыми дизайном сообществ.

4.8.2 [01.11.2022]:
Добавлена возможность использовать длительную задержку после получения каптчи и блокировки аккаунта:
настраивается в меню задержки (кнопка с шестерёнкой).

4.8.1 [30.10.2022]:
Исправлен баг, из-за которого в модуле "Беседы" при блокировке аккаунта и переходе к другому, программа вступала в беседу, но не могла отправить сообщение.

4.8 [27.10.2022]:
1. Добавлен новый модуль рассылки "Беседы".
В программу загружаются пригласительные ссылки на беседы. Программа вступает в них и отправляет ваше сообщение.
После отправки сообщения есть возможность выхода из беседы и удаления сообщений на аккаунте-отправителе.
2. Увеличено максимальное количество вложений в одном посте/сообщении до 10 (было 9).
3. Мелкие улучшения и повышение стабильности.

4.7.9/4.7.9.1 [19.10.2022]:
Восстановлена авторизация после обновлений ВК.

4.7.8 [18.10.2022]:
1. Исправлена ошибка "Не удалось получить access_token для аккаунта", которая возникала на аккаунтах с неуказанной датой рождения или полом.
2. Исправлена работа макросов.

4.7.7 [10.10.2022]:
Восстановлена работоспособность модуля "Стены пользователей" после обновления дизайна страниц ВК.

4.7.6 [29.09.2022]:
1. Окно тестирования рандомизации теперь может показывать три примера рандомизации текста вместо одного.
2. В модуле "Комментарии сообществ" исправлена ошибка, из-за которой, при выставленной глубине рассылки 1-1, программа не начинала рассылку.
3. В модуле "Стены пользователей" исправлена ошибка, из-за которой программа не рассылала посты с аккаунтов с новым дизайном профилей.

4.7.5 [16.09.2022]:
Добавлена функция рассылки голосовых сообщений с компьютера в формате mp3, ogg или webm.
Функция доступна в модулях: "Сообщения сообществ", "ЛС по списку" и "ЛС по друзьям".

4.7.4 [12.09.2022]:
Исправлена проблема с зависанием при получении каптчи.

4.7.3 [01.09.2022]:
Улучшен алгоритм рандомизации текста: теперь поддерживается многоуровневая рандомизация {{a|b|c}|{1|2|3}|{а|б|в}}.

4.7.2 [15.08.2022]:
Очередное обновление, призванное уменьшить блокировки за подозрительную активность.

4.7.1 [11.08.2022]:
Исправлены ошибки с авторизацией, допущенные в прошлом обновлении.

4.7 [10.08.2022]:
Обновлён алгоритм авторизации аккаунтов. Больше не должно быть блокировок за подозрительную активность после авторизации.

4.6.9 [04.08.2022]:
1. В модулях "Комментарии в сообществах" и "Комментарии пользователей" оптимизирована функция выбора постов для обработки.
2. Модули "Комментарии пользователей" и "Видео" оптимизированы для работы с мобильными прокси.

4.6.8 [29.07.2022]:
1. Исправлена ошибка, из-за которой программа не выводила информацию о недействительном ключе антикаптчи при авторизации.
2. В менеджере аккаунтов добавлена возможность открыть аккаунт в браузере при двойном клике по нему.

4.6.7 [29.06.2022]:
1. Добавлена возможность авторизовывать некоторые аккаунты без использования прокси, используя символ «-» в списке прокси.
2. Если аккаунты в формате логин:пароль:токен, то вручную обрезать токен больше не нужно.

4.6.6 [09.06.2022]:
В модуле "ЛС по друзьям" исправлена ошибка, из-за которой большинство пользователей пропускалось без причины.

4.6.5 [28.05.2022]:
1. Исправлена корректная работа программы с сервисом разгадывания каптч CapMonster.
2. Исправлены ошибки и повышена стабильность работы.

4.6.4 [16.05.2022]:
Повышена стабильность работы и исправлены ошибки.

4.6.3 [14.05.2022]:
1. Модуль "Комментарии в сообществах" оптимизирован для работы с мобильными прокси.
2. Добавлена возможность открытия блэклистов прямо из программы.
3. Исправлены ошибки.

4.6.2 [04.05.2022]:
Модули "Комментарии к записям" и "Обсуждения" оптимизированы для работы с мобильными прокси.

4.6.1 [30.04.2022]:
1. Модуль "Стены пользователей" оптимизирован для работы с мобильными прокси.
2. Исправлена некорректная работа функции повтора рассылки послё её окончания.

4.6 [27.04.2022]:
1. Модуль "ЛС по друзьям" оптимизирован для работы с мобильными прокси.
2. Восстановлена работоспособность рассылки с аккаунтов без привязки телефона.

4.5.9 [20.04.2022]:
Модуль "ЛС по списку" оптимизирован для работы с моб. прокси.

4.5.8 [18.04.2022]:
1. Исправлена ошибка получения каптчи при рассылке.
2. Восстановлена функция вступления в сообщества перед отправкой в них поста/сообщения.

4.5.7 [15.04.2022]:	
Модули "Стены групп", "Предложить новость", "Сообщения в группы" оптимизированы для работы с моб. прокси.

4.5.6 [08.04.2022]:
Восстановлена работоспособность авторизации аккаунтов.	

4.5.5 [30.03.2022]:
Восстановлена работоспособность после обновления ВК.

4.5.4 [23.02.2022]:
Восстановлена работоспособность после обновления ВК.

4.5.3 [21.03.2022]:
1. Исправлена ошибка, из-за которой поля для прикрепления ссылки в некоторых модулях были недоступны.
2. Увеличено окно выбора проектов.

4.5.2 [18.03.2022]:
Исправлены ошибки.

4.5.1 [16.03.2022]:
Добавлен новый режим использования прикреплений: последовательно.
Можно рассылать несколько прикреплений в последовательном режиме.

4.5 [02.03.2022]:
Исправлена ошибка "Сообщения в сообществе отключены" при рассылке по сообщениям сообществ.
	
4.4.9 [10.01.2022]:
Исправлены ошибки и повышена стабильность работы.

4.4.8 [25.12.2021]:	
Восстановлена работоспособность рассылки по ЛС друзьям после обновления ВК.
	
4.4.7 [12.12.2021]:
Улучшен алгоритм выбора и пропуска постов при рассылке в комментарии сообществ.

4.4.6 [01.12.2021]:
Исправлена ошибка "Unable to write to..."

4.4.5 [30.10.2021]:
1. Добавлена проверка и удаление ссылок, найденных в блэклисте, перед началом рассылки. Активируется, когда поставлены обе галочки "Проверять на наличие в блэклисте" и "Удалять обработанные из списка".
2. Улучшен алгоритм вставки случайных Emoji в текст.
3. Исправлена проблема, из-за которой русскоязычный текст, вставленный из буфера обмена, иногда превращался в вопросительные знаки.

4.4.4.1 [27.10.2021]:	
1. Исправлена проблема с авторизацией аккаунтов.
2. Исправлена ошибка, из-за которой некоторые посты пропускались из-за, якобы, закрытых комментариев.

4.4.4 [21.09.2021]:

Теперь при поставленной галочке "Удалять обработанные ссылки", также будут удаляться и ссылки, найденные в блэклисте.

4.4.3 [02.09.2021]:

1. Исправлена неработающая рассылка по стенам пользователей.
2. Исправлен не сохраняющийся режим рассылки при закрытии программы в модуле "ЛС по списку".

4.4.2 [19.08.2021]:

Исправлена ошибка "Запись не найдена", иногда возникающая в модулях "Комментарии в сообществах" и "Комментарии пользователей".


4.4.1.1[04.08.2021]:

Исправлены ошибки.


4.4.1 [03.08.2021]:
1. Исправлен не сохраняющийся режим рассылки при закрытии программы в некоторых модулях.
2. Исправлена ошибка при запуске программы, возникающая на некоторых ПК.


4.4[27.04.2021]:
	
Во всех модулях добавлена возможность прикрепления изображений с ПК.


4.3 [23.03.2021]:

Добавлена возможность прикрепления товаров из маркета, а также обновлена инструкция по использованию вложений.

4.2.9 [15.02.2021]:

1. Исправлена функция долгой задержки (ЛС друзьям).
2. Исправлен неработающий лимит сообщений с аккаунта (ЛС по друзьям).


4.2.8 [25.12.2020]:

Исправлены ошибки и повышена стабильность работы.


4.2.7 [14.11.2020]:

1. Добавлены несколько новых макросов для текста: 
Случайный символьный смайл: %smile%
Случайный emoji: %emoji%
Случайный любовный emoji %emojilove%
Случайное число от 0 до 9: %num%
Случайное число от 0 до 9 в виде emoji: %emojinum%
Случайная русская буква маленькая (а....я): %symrus%
Случайная латинская буква маленькая (a...z): %symeng%
Случайная русская буква большая (А....Я): %SYMRUS%
Случайная латинская буква большая (Z...A): %SYMENG%
В связи с новыми макросами, была также обновлена инструкция к программе.

2. Исправлены ошибки во время авторизации.


4.2.6 [08.11.2020]:
Исправлены ошибки и повышена стабильность работы.


4.2.5 [17.10.2020]:
Исправлены ошибки.


4.2.1 [20.09.2020]:
1. Добавлена функция автосохранения логов в текстовый файл через указанное количество минут.
2. Исправлены ошибки.


4.2 [23.06.2020]:
Во все модули, касающиеся рассылки по пользователям, а именно: "ЛС по списку", "Стены пользователей", "Комментарии пользователей" — добавлены фильтры "Был в сети не более..." и выбор устройства (ПК, телефон или конкретная платформа Android/iOS).


4.1.2 [16.06.2020]:
Исправлены ошибки.


4.1 [02.06.2020]:
	
Добавлен модуль рассылки личных сообщений друзьям по критериям:
- Страна и город
- Онлайн (только онлайн или был в сети N минут/часов/суток назад) с выбором устройства (ПК, телефон или конкретная платформа Android/iOS).
- Возраст
- Пол
- Семейное положение
- Количество общих друзей
- Наличие аватарки


4.0.2 [27.05.2020]:

Более стабильная работа с мобильными прокси

4.0 [17.03.2020]:
	
1. Обновлённый менеджер аккаунтов:
- появилась возможность отключать отдельные аккаунты от работы в каждом модуле.
- при достижении лимитов аккаунт не удаляется, а помечается как нерабочий. При желании его можно заново включить без повторной авторизации.
- возможность сохранить Ваши аккаунты вместе с прокси, в любом формате.

2. Новый функционал прикрепления ссылок:
- возможность указать фото и заголовок как в ручном режиме, так и автоматически подгрузить по Вашей ссылке.
- автоматическое прикрепление видеозаписей с youtube в формате видео, а не ссылкой, как ранее.

3. Возможность выставить лимит неудачных запросов не только во время авторизации, но и во время работы:
Если один из прокси перестал работать, то через указанное количество попыток аккаунт автоматически отключится от рассылки.

4. Некоторые модули, не имеющие информации о результатах рассылки его получили:
Предложить новость: ссылки на паблики, куда пост был успешно предложен
Сообщения сообществ: ссылки на сообщества, куда было отправлено сообщение
Личные сообщения: пользователи, которым было отправлено сообщение
Видео: ссылки на отправленные комментарии

5. Добавлены галочки, активирующие функции восстановления удалённых аккаунтов и обхода проверки безопасности (ввод номера).
6. Изменён алгоритм замены раскладки при рандомизации. Теперь вероятность замены сиволов распространяется на каждый символ текста отдельно.
7. В модуле "Видео" появилась возможность прикрепления ссылки с превью.
8. Добавлена возможность рассылки с аккаунтов не привязанных к телефону (через ввод каптчи).
9. Добавлена возможность прикрепления опросов. Формат: poll-123123_321321
10. Смена режима рассылки (последовательно/до лимита) перенесена в доп. настройки и теперь может настраиваться индивидуально для каждого модуля.
11. Рассылка от имени сообщества теперь также перенесена в "Дополнительные настройки" каждого модуля.
12. Добавили счетчик количества символов в тексте, а также счетчик, показывающий количество вложений.
13. Теперь при каждом запуске программа загружает самые актуальные UserAgents с нашего сервера.
14. Добавили более стабильную работу с мобильными прокси.
15. Исправлена ложная ошибка "Аккаунт встретил лимит и отключен от работы", когда прикрепляется ссылка.
16. Сообщения сообществ: добавлена возможность отправки сообщений закрытым сообществам с открытыми сообщениями.
17. В модуле "Комментарии в сообществах" добавлена возможность пропуска, как постов, находящихся в блеклисте, так и самих сообществ.
18. Добавлена новая настройка вложений "Не использовать вложения".
19. Вложения теперь можно прикреплять просто ссылкой vk.com/photo123123_321321.
20. Если не будет ключа аниткаптчи, и при рассылке будет встречена каптча, рассылка будет завершена.
21. Исправлена ошибка: если на аккаунте во время рассылки менялся пароль, он помечался как заблокированный.
</NewVersionInfo><ads>false</ads>23<codeADS>appcbkp8l0d0c98dckpk08oip008c89d</codeADS><before_to>1718768547</before_to><UserAgentsVk>
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:125.0) Gecko/20100101 Firefox/125.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36 Edg/124.0.0.0
Mozilla/5.0 (X11; Linux x86_64; rv:125.0) Gecko/20100101 Firefox/125.0
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko)
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 YaBrowser/24.1.0.0 Safari/537.36
Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:125.0) Gecko/20100101 Firefox/125.0
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.0 Safari/605.1.15
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.5938.132 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:123.0) Gecko/20100101 Firefox/123.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:124.0) Gecko/20100101 Firefox/124.0
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:109.0) Gecko/20100101 Firefox/115.0
Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:124.0) Gecko/20100101 Firefox/124.0
Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:126.0) Gecko/20100101 Firefox/126.0
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 YaBrowser/24.1.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.1 Safari/605.1.15
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3 Safari/605.1.15
Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4 Safari/605.1.15
Mozilla/5.0 (Macintosh; Intel Mac OS X 14_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; rv:125.0) Gecko/20100101 Firefox/125.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 YaBrowser/23.7.0.2534 Yowser/2.5 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.6099.224 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Iron Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36 OPR/108.0.0.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36 Edg/123.0.0.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.84 Safari/537.36
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:102.0) Gecko/20100101 Firefox/102.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/116.0
Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:83.0) Gecko/20100101 Firefox/83.0
Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36
Mozilla/5.0 (Windows NT 6.1; rv:102.0) Gecko/20100101 Goanna/6.6 Firefox/102.0 PaleMoon/33.0.0
Mozilla/5.0 (X11; CrOS x86_64 14541.0.0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36 Edg/124.0.0.0
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/94.0.4606.85 Safari/537.36 OPR/80.0.4170.72
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) HeadlessChrome/120.0.6099.28 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) HeadlessChrome/92.0.4515.159 Safari/537.36
Mozilla/5.0 (X11; Linux x86_64) Gecko/20060609 Firefox/123.0esr
Mozilla/5.0 (X11; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/115.0
Mozilla/5.0 (X11; Linux x86_64; rv:91.0) Gecko/20100101 Firefox/91.0
Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/117.0
</UserAgentsVk><lastUpdate>4.9.8.1 от 30.01.2024</lastUpdate>